{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,3],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,3],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,16],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["input1",0,0,{}],["input2",0,0,{}],["input3",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"sequential_1","class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,16],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["input4",0,0,{}],["conv2d_Conv2D3",0,0,{}]]]}],"input_layers":[["input4",0,0]],"output_layers":[["add_Add1",0,0]]}},{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,16],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["input5",0,0,{}],["conv2d_Conv2D5",0,0,{}]]]}],"input_layers":[["input5",0,0]],"output_layers":[["add_Add2",0,0]]}},{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,16],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"conv2d_Conv2D7","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["input6",0,0,{}],["conv2d_Conv2D7",0,0,{}]]]}],"input_layers":[["input6",0,0]],"output_layers":[["add_Add3",0,0]]}},{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,16],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"conv2d_Conv2D8","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D8","trainable":true},"inbound_nodes":[[["input7",0,0,{}]]]},{"name":"conv2d_Conv2D9","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D9","trainable":true},"inbound_nodes":[[["conv2d_Conv2D8",0,0,{}]]]},{"name":"add_Add4","class_name":"Add","config":{"name":"add_Add4","trainable":true},"inbound_nodes":[[["input7",0,0,{}],["conv2d_Conv2D9",0,0,{}]]]}],"input_layers":[["input7",0,0]],"output_layers":[["add_Add4",0,0]]}},{"class_name":"Model","config":{"name":"model5","layers":[{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,16],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"conv2d_Conv2D10","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D10","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"conv2d_Conv2D11","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D11","trainable":true},"inbound_nodes":[[["conv2d_Conv2D10",0,0,{}]]]},{"name":"add_Add5","class_name":"Add","config":{"name":"add_Add5","trainable":true},"inbound_nodes":[[["input8",0,0,{}],["conv2d_Conv2D11",0,0,{}]]]}],"input_layers":[["input8",0,0]],"output_layers":[["add_Add5",0,0]]}}]},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D13","class_name":"Conv2D","config":{"filters":48,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D13","trainable":true},"inbound_nodes":[[["sequential_1",1,0,{}]]]},{"name":"depth_to_space_DepthToSpace1","class_name":"DepthToSpace","config":{"name":"depth_to_space_DepthToSpace1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D13",0,0,{}]]]},{"name":"bilinear_resize_BilinearResize1","class_name":"BilinearResize","config":{"name":"bilinear_resize_BilinearResize1","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"add_Add6","class_name":"Add","config":{"name":"add_Add6","trainable":true},"inbound_nodes":[[["depth_to_space_DepthToSpace1",0,0,{}],["bilinear_resize_BilinearResize1",0,0,{}]]]},{"name":"conv2d_Conv2D12","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D12","trainable":true},"inbound_nodes":[[["sequential_1",1,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0]],"output_layers":[["add_Add6",0,0],["conv2d_Conv2D12",0,0]]},"keras_version":"tfjs-layers 4.12.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[3,3,22,16],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D7/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D8/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D8/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D9/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D9/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D10/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D10/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D11/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D11/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D13/kernel","shape":[3,3,16,48],"dtype":"float32"},{"name":"conv2d_Conv2D13/bias","shape":[48],"dtype":"float32"},{"name":"conv2d_Conv2D12/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D12/bias","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.12.0","convertedBy":null}